multiRegionDuineveldRisingBubble/baseMeshes/meshA/0/curvatureNew
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      curvatureNew;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    interface
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
982.471292386859
981.4602501745952
980.2700023414391
978.8569900775819
977.161397739633
975.099377526113
972.5494503111545
969.329070271108
...
)
;
    }
    space
    {
        type            calculated;
        value           uniform 0;
    }
    lowerWedge
    {
        type            wedge;
    }
    upperWedge
    {
        type            wedge;
    }
    centerline
    {
        type            symmetryPlane;
        value           uniform 0;
    }
}


// ************************************************************************* //
